#! /usr/bin/perl
use 5.012;

# 	say  2**16;# 			65536
# 	say 2**32; # 4294967296

# 	if(! open POET,"poet"){
# 		die "IO异常：".$!;
# 	}
# 	while(<POET>){
# 		chomp;
# 		say;
# 	}
# 	close POET;
# 
# 				================================================================================
# 				2018年8月4日 23:30:29
# 				~/Desktop/chapter05files.pl
# 				--------------------------------------------------------------------------------
# 				吾家洗砚池头树，个个花开淡墨痕。
# 				不要人夸好颜色，只流清气满乾坤。(版本一)
# 
# 				我家洗砚池边树，朵朵花开淡墨痕。
# 				不要人夸颜色好，只留清气满乾坤。(版本二)

# 	open LOG,'>','log';
# 	print LOG "Captain's log:stardate 3.14159";
# 	print STDERR ("%d percent complete.",27);
# 	close LOG;
